cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N19A.svd
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHEVCTRL%s</name>
          <description>Channel n Event Control</description>
          <addressOffset>0x46</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>EVACT</name>
              <description>Channel Event Input Action</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>EVACTSelect</name>
                <enumeratedValue>
                  <name>NOACT</name>
                  <description>No action</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIG</name>
                  <description>Transfer and periodic transfer trigger</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTRIG</name>
                  <description>Conditional transfer trigger</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBLOCK</name>
                  <description>Conditional block transfer</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUSPEND</name>
                  <description>Channel suspend operation</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESUME</name>
                  <description>Channel resume operation</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSKIP</name>
                  <description>Skip next block suspend action</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCPRI</name>
                  <description>Increase priority</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOMODE</name>
              <description>Channel Event Output Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>EVOMODESelect</name>
                <enumeratedValue>
                  <name>DEFAULT</name>
                  <description>Block event output selection. Refer to BTCTRL.EVOSEL for available selections.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TRIGACT</name>
                  <description>Ongoing trigger action</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVIE</name>
              <description>Channel Event Input Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVOE</name>
              <description>Channel Event Output Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHINTENCLR%s</name>
          <description>Channel n Interrupt Enable Clear</description>
          <addressOffset>0x4C</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Channel Transfer Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Channel Transfer Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHINTENSET%s</name>
          <description>Channel n Interrupt Enable Set</description>
          <addressOffset>0x4D</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Channel Transfer Error Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Channel Transfer Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHINTFLAG%s</name>
          <description>Channel n Interrupt Flag Status and Clear</description>
          <addressOffset>0x4E</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>TERR</name>
              <description>Channel Transfer Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCMPL</name>
              <description>Channel Transfer Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Channel Suspend</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>32</dim>
          <dimIncrement>0x10</dimIncrement>
          <name>CHSTATUS%s</name>
          <description>Channel n Status</description>
          <addressOffset>0x4F</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>PEND</name>
              <description>Channel Pending</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>Channel Busy</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FERR</name>
              <description>Channel Fetch Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCERR</name>
              <description>Channel CRC Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
