cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N19A.svd
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CONFIG%s</name>
          <description>External Interrupt Sense Configuration</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SENSE0</name>
              <description>Input Sense Configuration 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE0Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN0</name>
              <description>Filter Enable 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE1</name>
              <description>Input Sense Configuration 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE1Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN1</name>
              <description>Filter Enable 1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE2</name>
              <description>Input Sense Configuration 2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE2Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN2</name>
              <description>Filter Enable 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE3</name>
              <description>Input Sense Configuration 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE3Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN3</name>
              <description>Filter Enable 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE4</name>
              <description>Input Sense Configuration 4</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE4Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN4</name>
              <description>Filter Enable 4</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE5</name>
              <description>Input Sense Configuration 5</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE5Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN5</name>
              <description>Filter Enable 5</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE6</name>
              <description>Input Sense Configuration 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE6Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN6</name>
              <description>Filter Enable 6</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SENSE7</name>
              <description>Input Sense Configuration 7</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SENSE7Select</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No detection</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <description>Rising edge detection</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALL</name>
                  <description>Falling edge detection</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Both edges detection</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>High level detection</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Low level detection</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTEN7</name>
              <description>Filter Enable 7</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DEBOUNCEN</name>
          <description>Debouncer Enable</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DEBOUNCEN</name>
              <description>Debouncer Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DPRESCALER</name>
          <description>Debouncer Prescaler</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>PRESCALER0</name>
              <description>Debouncer Prescaler</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>PRESCALER1</name>
              <description>Debouncer Prescaler</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>STATES0</name>
              <description>Debouncer number of states</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STATES1</name>
              <description>Debouncer number of states</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TICKON</name>
              <description>Pin Sampler frequency selection</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PINSTATE</name>
          <description>Pin State</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>PINSTATE</name>
              <description>Pin State</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
