cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N19A.svd
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Synchroniation Busy bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>GENCTRL0</name>
              <description>Generic Clock Generator Control 0 Synchronization Busy bits</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL0Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL1</name>
              <description>Generic Clock Generator Control 1 Synchronization Busy bits</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL1Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL2</name>
              <description>Generic Clock Generator Control 2 Synchronization Busy bits</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL2Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL3</name>
              <description>Generic Clock Generator Control 3 Synchronization Busy bits</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL3Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL4</name>
              <description>Generic Clock Generator Control 4 Synchronization Busy bits</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL4Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL5</name>
              <description>Generic Clock Generator Control 5 Synchronization Busy bits</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL5Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL6</name>
              <description>Generic Clock Generator Control 6 Synchronization Busy bits</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL6Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL7</name>
              <description>Generic Clock Generator Control 7 Synchronization Busy bits</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL7Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
