cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51N19A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MCLK</name>
      <version>1.0.0</version>
      <description>Main Clock</description>
      <groupName>MCLK</groupName>
      <prependToName>MCLK_</prependToName>
      <baseAddress>0x40000800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>MCLK</name>
        <value>1</value>
      </interrupt>
      <registers>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CKRDY</name>
              <description>Clock Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x02</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CKRDY</name>
              <description>Clock Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x03</addressOffset>
          <size>8</size>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>CKRDY</name>
              <description>Clock Ready</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HSDIV</name>
          <description>HS Clock Division</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>CPU Clock Division Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>DIVSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CPUDIV</name>
          <description>CPU Clock Division</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <resetValue>0x01</resetValue>
          <fields>
            <field>
              <name>DIV</name>
              <description>Low-Power Clock Division Factor</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>DIVSelect</name>
                <enumeratedValue>
                  <name>DIV1</name>
                  <description>Divide by 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV2</name>
                  <description>Divide by 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV4</name>
                  <description>Divide by 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV8</name>
                  <description>Divide by 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV16</name>
                  <description>Divide by 16</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV32</name>
                  <description>Divide by 32</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV64</name>
                  <description>Divide by 64</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIV128</name>
                  <description>Divide by 128</description>
                  <value>0x80</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>AHBMASK</name>
          <description>AHB Mask</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <resetValue>0x00FFFFFF</resetValue>
          <fields>
            <field>
              <name>HPB0_</name>
              <description>HPB0 AHB Clock Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPB1_</name>
              <description>HPB1 AHB Clock Mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPB2_</name>
              <description>HPB2 AHB Clock Mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HPB3_</name>
              <description>HPB3 AHB Clock Mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSU_</name>
              <description>DSU AHB Clock Mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HMATRIX_</name>
              <description>HMATRIX AHB Clock Mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL_</name>
              <description>NVMCTRL AHB Clock Mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HSRAM_</name>
              <description>HSRAM AHB Clock Mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CMCC_</name>
              <description>CMCC AHB Clock Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMAC_</name>
              <description>DMAC AHB Clock Mask</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB_</name>
              <description>USB AHB Clock Mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BKUPRAM_</name>
              <description>BKUPRAM AHB Clock Mask</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAC_</name>
              <description>PAC AHB Clock Mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_</name>
              <description>QSPI AHB Clock Mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDHC0_</name>
              <description>SDHC0 AHB Clock Mask</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SDHC1_</name>
              <description>SDHC1 AHB Clock Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICM_</name>
              <description>ICM AHB Clock Mask</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PUKCC_</name>
              <description>PUKCC AHB Clock Mask</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_2X_</name>
              <description>QSPI_2X AHB Clock Mask</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL_SMEEPROM_</name>
              <description>NVMCTRL_SMEEPROM AHB Clock Mask</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL_CACHE_</name>
              <description>NVMCTRL_CACHE AHB Clock Mask</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBAMASK</name>
          <description>APBA Mask</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <resetValue>0x000007FF</resetValue>
          <fields>
            <field>
              <name>PAC_</name>
              <description>PAC APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PM_</name>
              <description>PM APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCLK_</name>
              <description>MCLK APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RSTC_</name>
              <description>RSTC APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSCCTRL_</name>
              <description>OSCCTRL APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OSC32KCTRL_</name>
              <description>OSC32KCTRL APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUPC_</name>
              <description>SUPC APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GCLK_</name>
              <description>GCLK APB Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT_</name>
              <description>WDT APB Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC_</name>
              <description>RTC APB Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EIC_</name>
              <description>EIC APB Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FREQM_</name>
              <description>FREQM APB Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM0_</name>
              <description>SERCOM0 APB Clock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM1_</name>
              <description>SERCOM1 APB Clock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC0_</name>
              <description>TC0 APB Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1_</name>
              <description>TC1 APB Clock Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBBMASK</name>
          <description>APBB Mask</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <resetValue>0x00018056</resetValue>
          <fields>
            <field>
              <name>USB_</name>
              <description>USB APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DSU_</name>
              <description>DSU APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL_</name>
              <description>NVMCTRL APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PORT_</name>
              <description>PORT APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HMATRIX_</name>
              <description>HMATRIX APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVSYS_</name>
              <description>EVSYS APB Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM2_</name>
              <description>SERCOM2 APB Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM3_</name>
              <description>SERCOM3 APB Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC0_</name>
              <description>TCC0 APB Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC1_</name>
              <description>TCC1 APB Clock Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC2_</name>
              <description>TC2 APB Clock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC3_</name>
              <description>TC3 APB Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RAMECC_</name>
              <description>RAMECC APB Clock Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBCMASK</name>
          <description>APBC Mask</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <resetValue>0x00002000</resetValue>
          <fields>
            <field>
              <name>TCC2_</name>
              <description>TCC2 APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC3_</name>
              <description>TCC3 APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC4_</name>
              <description>TC4 APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC5_</name>
              <description>TC5 APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PDEC_</name>
              <description>PDEC APB Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC_</name>
              <description>AC APB Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES_</name>
              <description>AES APB Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNG_</name>
              <description>TRNG APB Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ICM_</name>
              <description>ICM APB Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>QSPI_</name>
              <description>QSPI APB Clock Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CCL_</name>
              <description>CCL APB Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APBDMASK</name>
          <description>APBD Mask</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SERCOM4_</name>
              <description>SERCOM4 APB Clock Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM5_</name>
              <description>SERCOM5 APB Clock Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM6_</name>
              <description>SERCOM6 APB Clock Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM7_</name>
              <description>SERCOM7 APB Clock Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC4_</name>
              <description>TCC4 APB Clock Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC6_</name>
              <description>TC6 APB Clock Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC7_</name>
              <description>TC7 APB Clock Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC0_</name>
              <description>ADC0 APB Clock Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC1_</name>
              <description>ADC1 APB Clock Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC_</name>
              <description>DAC APB Clock Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2S_</name>
              <description>I2S APB Clock Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PCC_</name>
              <description>PCC APB Clock Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
